Initializing gui preferences from file  /home/DREXEL/ekw47/.synopsys_icc_prefs.tcl
icc_shell> gui_start
Information: Visibility is turned ON for cells and cell contents because the task is set to Block Implementation (GUI-026)
icc_shell> ls
.                             default.svf                    reports
..                            filenames.log                  rtl
.nfs0000000001cd2a93000054bb  filenames_29017_D20170305.log  scripts
.synopsys_dc.setup            filenames_29169_D20170305.log  sensei.sh
Gate                          icc_output.txt                 srams
alib-52                       include                        unmapped
command.log                   lib                            work
common                        pr_macro
icc_shell> open scripts/icc_script.vim
file18
icc_shell> open scripts/icc_script.tcl
file19
icc_shell> ls
.                             default.svf                    rtl
..                            filenames_29017_D20170305.log  scripts
.nfs0000000001cd409100005516  filenames_29169_D20170305.log  sensei.sh
.synopsys_dc.setup            icc_output.txt                 srams
Gate                          include                        unmapped
alib-52                       lib                            work
command.log                   pr_macro
common                        reports
icc_shell> open icc_shell.tcl
Error: couldn't open "icc_shell.tcl": no such file or directory
        Use error_info for more info. (CMD-013)
icc_shell> open scripts/icc_shell.tcl
Error: couldn't open "scripts/icc_shell.tcl": no such file or directory
        Use error_info for more info. (CMD-013)
icc_shell> ls
.                             default.svf                    rtl
..                            filenames_29017_D20170305.log  scripts
.nfs0000000001cd409100005516  filenames_29169_D20170305.log  sensei.sh
.synopsys_dc.setup            icc_output.txt                 srams
Gate                          include                        unmapped
alib-52                       lib                            work
command.log                   pr_macro
common                        reports
icc_shell> open scripts/icc_script.tcl
file20
icc_shell> 